[
  {
    "id": 1,
    "sname":"softwarevisualization",
    "name": "Software Visualization",
    "subtitle": "Visualization of <strong>Complexity</strong> by means of Software",
    "date": "2008",
    "author": "Dominik Schlaepfer",
    "coffee": "120 Cups",
    "tags": ["programming", "3d"],
    "media": ["Software Visualization.pdf", "http://www.youtube.com/watch?v=gW_IMd5KqM4"],
    "pics": [0, 1],
    "description": "Aim of this project is the visualization of complex relations of items in big systems. Software code and Software architecture as a very abstract and very complex metaphor, oppose a good example to examine the benefits of visualization over pure code and alphanumerically written codes and metaphors. The visualization in the project is about method-calls in software projects. The main idea is to visualize a certain method-call and see what other methods are triggered by this call. The visualization takes part in a 3D-space, which enables the user to look at the method-call tree from different perspectives. The different perspectives provide different views and different conclusions to the method-call."
  },
  {
    "id": 2,
    "sname":"interactiondynamics",
    "name": "Interaction Dynamics",
    "subtitle": "Research new <strong>Interaction metaphors</strong>",
    "date": "2007",
    "author": "Dominik Schlaepfer",
    "coffee": "80 Cups",
    "tags": ["programming", "design"],
    "media": ["interaction Dynamics.pdf", "Interaction Dynamics.swf"],
    "pics": [0, 1],
    "description": "Interaction Dynamics is about examining interaction models. The task was to establish Interaction models to contradictory terms such as: big - small, many - few, inner - outer, visible - invisible."
  },
  {
    "id": 3,
    "sname":"radiozhagdak",
    "name": "ZagHdk Radio",
    "subtitle": "Interactive GPS <strong>Hearplay</strong>",
    "date": "2010",
    "author": "Dominik Schlaepfer, Lilian Kraus",
    "coffee": "Cups",
    "tags": ["physical", "programming"],
    "media": ["http://www.bwart.ch/radioZagHdaK/", "http://www.youtube.com/watch?v=ltFjPXyVbr8"],
    "pics": [0, 1],
    "description": "Core-concept: ZagHdaK Radio is an interactive GPS hear-play created at ZHdK in October 2009. The main concept is to have a real physical space (in our case Zürich] in which a user can move around randomly.This physical reality is then overlayed by a second perception layer (in our case audio feedback] which is supposedto guide the user around in the physical reality and provide him with different audio information depending on thechosen way. ZagHdaK-Radio plays with contrasts between imagination and reality and extends awareness and perception. Concept realisation: As second perception layer the ZagHdaK-Radio concept features an imaginary setup of an unnamed city in the Middle East. This imaginary layer is invisibly mapped over the physical reality and represented by audio feedback. Certain predefined points on the reality layer trigger certain soundactions on the audio layer. Interactivityis provided by the way we move around and by the way approaching the predefined points. When strolling around far fromthe predefined points the user is provided with monotonous audio-heartbeat; when approaching a point, the heartbeat speedsup and finally, depending on distance to that point, triggers different sounds. Every point is accessible by differentstreets and depending on the route chosen, one approaches the point in another context (correspondingly different sound isplayed on the audio-layer]. The predefined points and the corresponding soundfiles are arranged in a way that individualnarratives emerge when moving around. ZagHdaK radio is partly political since it talks about problematic tendencies inworld politics but does not consider itself as a purely political project; ZagHdaK radio features different approaches ofeveryday life in a middle eastern town."
  },
  {
    "id": 4,
    "sname":"futurecar",
    "name": "The Future Car",
    "subtitle": "How does the <strong>future car</strong> sound?",
    "date": "2010",
    "author": "Dominik Schlaepfer",
    "coffee": "100+ Cups",
    "tags": ["sound", "programming"],
    "media": ["", "http://www.youtube.com/watch?v=wI6bHefuae0"],
    "pics": [0, 1],
    "description": "This project is a cooperation project with Volkswagen. The topic is the future sound of cars. Volkswagen provided and Audi G5 equipped with sensors. These sensors fed a Pure Data patch with data. The patch again interpreted this data and forwarded it to a synthezizer which created the final audio outupt. The task was to set the process of boarding a  car to sound. (Sensors were placed in the door (open and close], the seat (sit down] and the security belt (closing].  A research revealed, that the design of car shapes incline more and more organic features in future sketches. This project  tries to apply this paradigm shift to the world of sounds. Three organic sound-skins were developped: liquid, bone and earthy."
  },
  {
    "id": 6,
    "sname":"ipadmediacontrol",
    "name": "iPad Media control",
    "subtitle": "<strong>Get rid of your remote controls!</strong>",
    "date": "2012",
    "author": "Dominik Schlaepfer",
    "coffee": "123 Cups",
    "tags": ["programming"],
    "media": ["", "http://www.youtube.com/watch?v=n3ULKeY49Pg"],
    "pics": [0, 1],
    "description": "..."
  },
  {
    "id": 7,
    "sname":"dynament",
    "name": "Dynament",
    "subtitle": "The future of media and commenting",
    "date": "2010",
    "author": "Dominik Schlaepfer",
    "coffee": "200 Cups",
    "tags": ["design", "programming"],
    "media": ["Dynament.pdf", "http://www.youtube.com/watch?v=tWNU4cw-MuM", "http://www.meta-vue.ch/BAdocu/wordpress/"],
    "pics": [0, 1],
    "description": "Ever since the web has become participative there are huge amounts of comments to nearly any kind of web content. Research shows that comments harbour underestimated information-carrier potential. Dynament is a concept which focuses on different web user groups and their distinguished acquaintances in relation with comments. The video featured in the media-section shows the concept video. Dynament helps the user to get more information out of comments. For further information check this link, there is plenty of information available. The project included the following steps: background research, user inquiry, concept, first prototype, evaluation, iterated  prototype. "
  },
  {
    "id": 8,
    "sname":"screentypo",
    "name": "Screen Typo",
    "subtitle": "A visionary <strong>synchronoptic</strong> program header for arte TV",
    "date": "2008",
    "author": "Dominik Schlaepfer",
    "coffee": "67 Cups",
    "tags": ["programming", "design"],
    "media": ["Screentypography.pdf", "http://www.youtube.com/watch?v=24zym4BERBc"],
    "pics": [0, 1],
    "description": "Screentypography features a synchronoptic program header for arte TV. The challenge is to present the TV-program and its contents (pictures, program-information, meta-data] in a user friendly and easily accessible way. The project uses the wheel as a time metaphor and provides the user with a micro and macro view to switch inbetween."
  },
  {
    "id": 10,
    "sname":"encodingspace",
    "name": "Encoding Space",
    "subtitle": "A digital, artistic abstraction of space!",
    "date": "2007",
    "author": "Dominik Schlaepfer",
    "coffee": "80 Cups",
    "tags": ["programming", "design"],
    "media": ["Encoding Space.pdf", "https://www.youtube.com/watch?v=NtSW6oWrajg"],
    "pics": [0, 1],
    "description": "Starting point in this project is a public space of about 100m in the city of Zurich. This space is analysed, segemented and in different steps digitalized. The digitalized abstractions are set together and animated. The space in its abstraction should be experienced with the animation. In this project the space featured is a 100 meter space at Langstrasse in Zurich. "
  },
  {
    "id": 11,
    "sname":"blackbox",
    "name": "Black Box",
    "subtitle": "Physical Computing meets Interaction Design",
    "date": "2009",
    "author": "Dominik Schlaepfer",
    "coffee": "120 + Cups",
    "tags": ["physical", "programming"],
    "media": ["Black Box.pdf", "https://www.youtube.com/watch?v=O0Z-Nd8ESRA"],
    "pics": [0, 1],
    "description": "Black Box is, as the name suggests a black box from which only the measures are given. The task was to give the box functionality. The concept of our project was to create a black box equipped with a light-sensor, that could, while moving it around like a computer mouse, distinguish between black and white surfaces and give the user a haptic feedback about it."
  }
]